test/120kmh/test_ab_result-Zero.txt
svenzik@AS400:~/Semester2/mobile-seminar/project/road-sign-rest/test/120kmh$../benchmark/test_ab_methods.sh http://raspberrypi-m2:9001/rest2fs http://raspberrypi-201:9002/rest2fs http://raspberrypi-m2:9001/s2img http://raspberrypi-201:9002/s2img http://raspberrypi-m2:9001/s2speed http://raspberrypi-201:9002/s2speed
testing file: 1-120kmh.jpg.json
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking raspberrypi-m2 (be patient).....done


Server Software:        Werkzeug/0.9.6
Server Hostname:        raspberrypi-m2
Server Port:            9001

Document Path:          /rest2fs
Document Length:        130 bytes

Concurrency Level:      1
Time taken for tests:   11.133 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      27600 bytes
Total body sent:        4363700
HTML transferred:       13000 bytes
Requests per second:    8.98 [#/sec] (mean)
Time per request:       111.326 [ms] (mean)
Time per request:       111.326 [ms] (mean, across all concurrent requests)
Transfer rate:          2.42 [Kbytes/sec] received
                        382.79 kb/s sent
                        385.21 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        5    9  11.2     10     117
Processing:    79  102  54.7     94     632
Waiting:       47   71  54.9     63     602
Total:         87  111  55.5    102     637

Percentage of the requests served within a certain time (ms)
  50%    102
  66%    106
  75%    111
  80%    115
  90%    124
  95%    129
  98%    224
  99%    637
 100%    637 (longest request)
testing file: 1-120kmh.jpg.json
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking raspberrypi-201 (be patient).....done


Server Software:        Werkzeug/0.9.6
Server Hostname:        raspberrypi-201
Server Port:            9002

Document Path:          /rest2fs
Document Length:        130 bytes

Concurrency Level:      1
Time taken for tests:   7.502 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      27600 bytes
Total body sent:        4363800
HTML transferred:       13000 bytes
Requests per second:    13.33 [#/sec] (mean)
Time per request:       75.015 [ms] (mean)
Time per request:       75.015 [ms] (mean, across all concurrent requests)
Transfer rate:          3.59 [Kbytes/sec] received
                        568.09 kb/s sent
                        571.68 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        2    4   6.5      3      68
Processing:    55   71  16.1     64     121
Waiting:       41   60  16.2     53     107
Total:         57   75  17.8     67     151

Percentage of the requests served within a certain time (ms)
  50%     67
  66%     72
  75%     83
  80%     88
  90%    100
  95%    119
  98%    125
  99%    151
 100%    151 (longest request)
testing file: 1-120kmh.jpg.json
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking raspberrypi-m2 (be patient).....done


Server Software:        Werkzeug/0.9.6
Server Hostname:        raspberrypi-m2
Server Port:            9001

Document Path:          /s2img
Document Length:        131191 bytes

Concurrency Level:      1
Time taken for tests:   213.867 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      13134000 bytes
Total body sent:        4363500
HTML transferred:       13119100 bytes
Requests per second:    0.47 [#/sec] (mean)
Time per request:       2138.668 [ms] (mean)
Time per request:       2138.668 [ms] (mean, across all concurrent requests)
Transfer rate:          59.97 [Kbytes/sec] received
                        19.92 kb/s sent
                        79.90 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        5   11  11.0     11     117
Processing:  1900 2128 182.8   2110    2769
Waiting:     1757 1969 172.4   1956    2611
Total:       1911 2139 182.3   2118    2780

Percentage of the requests served within a certain time (ms)
  50%   2118
  66%   2190
  75%   2217
  80%   2259
  90%   2369
  95%   2516
  98%   2742
  99%   2780
 100%   2780 (longest request)
testing file: 1-120kmh.jpg.json
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking raspberrypi-201 (be patient).....done


Server Software:        Werkzeug/0.9.6
Server Hostname:        raspberrypi-201
Server Port:            9002

Document Path:          /s2img
Document Length:        131191 bytes

Concurrency Level:      1
Time taken for tests:   208.544 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      13134000 bytes
Total body sent:        4363600
HTML transferred:       13119100 bytes
Requests per second:    0.48 [#/sec] (mean)
Time per request:       2085.437 [ms] (mean)
Time per request:       2085.437 [ms] (mean, across all concurrent requests)
Transfer rate:          61.50 [Kbytes/sec] received
                        20.43 kb/s sent
                        81.94 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        2    3   0.9      3       6
Processing:  1926 2082 120.1   2048    2595
Waiting:     1852 2001 119.6   1966    2508
Total:       1929 2085 120.1   2051    2598

Percentage of the requests served within a certain time (ms)
  50%   2051
  66%   2080
  75%   2090
  80%   2113
  90%   2301
  95%   2357
  98%   2377
  99%   2598
 100%   2598 (longest request)
testing file: 1-120kmh.jpg.json
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking raspberrypi-m2 (be patient).....done


Server Software:        Werkzeug/0.9.6
Server Hostname:        raspberrypi-m2
Server Port:            9001

Document Path:          /s2speed
Document Length:        10997 bytes

Concurrency Level:      1
Time taken for tests:   337.125 seconds
Complete requests:      100
Failed requests:        84
   (Connect: 0, Receive: 0, Length: 84, Exceptions: 0)
Total transferred:      1149637 bytes
Total body sent:        4363700
HTML transferred:       1134837 bytes
Requests per second:    0.30 [#/sec] (mean)
Time per request:       3371.250 [ms] (mean)
Time per request:       3371.250 [ms] (mean, across all concurrent requests)
Transfer rate:          3.33 [Kbytes/sec] received
                        12.64 kb/s sent
                        15.97 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        6   11   6.1     11      55
Processing:  3071 3360 182.5   3354    4001
Waiting:     3028 3320 182.7   3319    3971
Total:       3082 3371 181.2   3363    4009

Percentage of the requests served within a certain time (ms)
  50%   3363
  66%   3444
  75%   3481
  80%   3505
  90%   3608
  95%   3698
  98%   3857
  99%   4009
 100%   4009 (longest request)
testing file: 1-120kmh.jpg.json
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking raspberrypi-201 (be patient).....done


Server Software:        Werkzeug/0.9.6
Server Hostname:        raspberrypi-201
Server Port:            9002

Document Path:          /s2speed
Document Length:        10999 bytes

Concurrency Level:      1
Time taken for tests:   348.349 seconds
Complete requests:      100
Failed requests:        22
   (Connect: 0, Receive: 0, Length: 22, Exceptions: 0)
Non-2xx responses:      1
Total transferred:      1138985 bytes
Total body sent:        4363800
HTML transferred:       1124141 bytes
Requests per second:    0.29 [#/sec] (mean)
Time per request:       3483.486 [ms] (mean)
Time per request:       3483.486 [ms] (mean, across all concurrent requests)
Transfer rate:          3.19 [Kbytes/sec] received
                        12.23 kb/s sent
                        15.43 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        2    7  14.5      4      95
Processing:  3296 3477 160.6   3412    4012
Waiting:     3276 3458 160.6   3393    3993
Total:       3300 3483 162.2   3417    4016

Percentage of the requests served within a certain time (ms)
  50%   3417
  66%   3481
  75%   3583
  80%   3611
  90%   3715
  95%   3821
  98%   3991
  99%   4016
 100%   4016 (longest request)